INSERT INTO COGNITIVE_STYLE_DESCRIPTION (STYLE, DESCRIPTION)
VALUES ('fieldDependence','Полезависимость означает, что человек опирается на ' ||
                          'внешние признаки при решении задач, может опускать детали ' ||
                          'и не придавать им значения'),
       ('fieldIndependence','Поленезависмость характеризуется более подробным и глубоким анализом,' ||
                            ' поленезависимый человек меньше подвержен влиянию внешних факторов,
                          обращает внимание больше на существенные особенности, чем заметные черты'),
       ('impulsivity','Импульсивность показывает на более быстрое принятие решений, которое ' ||
                      'основывается больше на интуиции и спонтанности. Импульсивные хуже, чем рефлексивные ' ||
                      'справляются с заданиями на решение проблем без альтернативных или предложенных вариантов ответа. ' ||
                      'Импульсивные обладают меньшим самоконтролем, низкой концентрацией внимания'),
       ('reflectivity','Для рефлексивных людей характерно обдумывание решений, ' ||
                       'это люди склонные несколько дольше решать поставленные задачи, ' ||
                       'взвешивая все за и против и тщательно аргументируя свой выбор. Рефлективные более поленезависимы, ' ||
                       'чем импульсивные, также у них выше устойчивость внимания.');